{
	"paragraph 1": {
		"title": "Who am I?",
		"content": "My name is Marisa Richmond. I am a self-taught software developer native to the Kansas City area. I currently reside in Shawnee with my husband and highschool sweetheart, Darrien, and our cat, Oliver"
	},
	"paragraph 2": {
		"title": "How did I get into software development?",
		"content": "A lot of people ask me this question when they hear that I'm self-taught. I actually spent the majority of my college career at KU studying to be an educator. However, I also spent a lot of my time on Georgia Tech's campus visiting Darrien. We were long-distance at the time. I found myself sitting in on many of his computer science classes. In fact, I even took a gap year between my junior and senior year where I exclusively lived in Atlanta. It was at this time that I developed an interest in programming. However, I felt that I was too deep into my own college career to switch majors, so I contented myself with learning to develop at my leisure. My first year out of college, I got a job as an assistant preschool teacher. Less than three hours in, I disliked the job so much--it required very little skill and was not even remotely mentally challenging--that I resolved to accelerate my learning of software development. Darrien suggested that I start learning Java and get certified in hopes of landing a software development job. For that whole first year, I spent 6-8 hours a night, after coming home from a 10-hour-a-day job, learning Java and working on a personal project to apply my skills. By the end of the year, I managed to pass the Java 8 SE certification exam and gained the interest of a local machine learning startup called RiskGenius. I was given an internship opportunity that turned into a permanent position and achieved my dream of becoming a software developer."
	},
	"paragraph 3": {
		"title": "What experience do I have?",
		"content": "For what I lack in higher education, I make up for in passion and determination. As I briefly mentioned before, I started my professional career as an intern at a insurtech startup called RiskGenius. I was intially one of just 4 developers on the team. Due to the volatile nature of a startup, halfway through my internship, the 3 most senior developers went heads down to complete a critical feature, leaving me unguided with another self-taught intern and a newly hired developer. I guess you could say I was put through the fire to earn my place as a permanent hire. Even despite this, I was able to learn the entire system, pick up multiple new JavaScript frameworks (BackboneJS and ReactJS) and help to roll out the front-end piece of the company's feature ahead of schedule. However, much of my career at RiskGenius has been spent building the second iteration of their SaaS software from the ground up. I have experience working on the full-stack of a single-page ReactJS application with a NodeJS/Python microservice back-end. I have completed and integrated multiple POCs with no guidance, as well as completed epic-level and story-level tasks on my own. I have stood up and fully-tested both NodeJS and Python services. All in all, I have gained a wealth of knowledge from my experience working at RiskGenius due to the fast-paced iteratory style of a startup. Working there has allowed me to develop both collaboratively as well as with little guidance in order to meet stringent deadlines."
	},
	"paragraph 4": {
		"title": "What are my interests?",
		"content": "I have a number of interests both inside and outside of development. Obviously, my greatest interest is in computer science. Not to sound like a tryhard, but I genuinely enjoy learning outside of the job because I feel like there is just so much I don't know, and I want to understand how everything works from front-to-back. In fact, I have dappled in the idea of pursuing a master's in computer science. However, due to the high price of continued education, I have settled for watching PluralSight courses, reading daily Medium articles, and solving coding problems for fun. Outside of software development, I enjoy playing League of Legends with Darrien and my co-workers, Andrew and Joe. I don't even want to think about how much time I have sunk into that game only to still suck at it most days. Prior to learning how to code, I wrote my own novels. I have tried to pick it back up from time to time. On top of that, I spend an hour and half each morning on the treadmill to curb my Andy's chocolate milkshake addiction, because I love sweets but don't want to look like I love sweets. My favorite place on Earth is the beach--any beach really--and my favorite non-sweet food is pretty much any type of seafood."
	},
	"paragraph 5": {
		"title": "Why should you hire me?",
		"content": "You should hire me because I am passionate about what I do. When I love something, I give it my all, and an enthusiastic and driven worker is a valuable asset to any company. I take pride in my work and strive to be a life-long learner. After all, frameworks and features of languages are always changing. If you hire me, I can promise you that I will work hard to ensure the success of the company and of my team, because I derive satisfaction from seeing the outcome of hardwork and from overcoming challenges. Thank you for your time!"
	}
}